Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/GD32VF103/Includes/Registers/GD32VF103_timer4.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     GD32VF103_timer4 equates.
 */

#pragma once

#include    <stdint.h>

// TIMER4 address definitions
// --------------------------

typedef struct {
    volatile    uint16_t    CTL0;
    volatile    uint16_t    RESERVED0;
    volatile    uint16_t    CTL1;
    volatile    uint16_t    RESERVED1;
    volatile    uint16_t    SMCFG;
    volatile    uint16_t    RESERVED2;
    volatile    uint16_t    DMAINTEN;
    volatile    uint16_t    RESERVED3;
    volatile    uint16_t    INTF;
    volatile    uint16_t    RESERVED4;
    volatile    uint16_t    SWEVG;
    volatile    uint16_t    RESERVED5;
    volatile    uint16_t    CHCTL0;
    volatile    uint16_t    RESERVED6;
    volatile    uint16_t    CHCTL1;
    volatile    uint16_t    RESERVED7;
    volatile    uint16_t    CHCTL2;
    volatile    uint16_t    RESERVED8;
    volatile    uint16_t    CNT;
    volatile    uint16_t    RESERVED9;
    volatile    uint16_t    PSC;
    volatile    uint16_t    RESERVED10;
    volatile    uint16_t    CAR;
    volatile    uint16_t    RESERVED11[3];
    volatile    uint32_t    CH0CV;
    volatile    uint32_t    CH1CV;
    volatile    uint32_t    CH2CV;
    volatile    uint32_t    CH3CV;
    volatile    uint32_t    RESERVED12;
    volatile    uint16_t    DMACFG;
    volatile    uint16_t    RESERVED13;
    volatile    uint32_t    DMATB;
} TIMER4_TypeDef;

#ifdef __cplusplus
#define TIMER4  reinterpret_cast<TIMER4_TypeDef *>(0x40000C00U)

#else
#define TIMER4  ((TIMER4_TypeDef *)0x40000C00U)
#endif

// CTL0 Configuration

#define TIMER4_CTL0_CEN             (0x1U<<0)
#define TIMER4_CTL0_UPDIS           (0x1U<<1)
#define TIMER4_CTL0_UPS             (0x1U<<2)
#define TIMER4_CTL0_SPM             (0x1U<<3)
#define TIMER4_CTL0_DIR             (0x1U<<4)
#define TIMER4_CTL0_CAM             (0x3U<<5)
#define TIMER4_CTL0_CAM_0           (0x1U<<5)
#define TIMER4_CTL0_ARSE            (0x1U<<7)
#define TIMER4_CTL0_CKDIV           (0x3U<<8)
#define TIMER4_CTL0_CKDIV_0         (0x1U<<8)

// CTL1 Configuration

#define TIMER4_CTL1_DMAS            (0x1U<<3)
#define TIMER4_CTL1_MMC             (0x7U<<4)
#define TIMER4_CTL1_MMC_0           (0x1U<<4)
#define TIMER4_CTL1_TI0S            (0x1U<<7)

// SMCFG Configuration

#define TIMER4_SMCFG_SMC            (0x7U<<0)
#define TIMER4_SMCFG_SMC_0          (0x1U<<0)
#define TIMER4_SMCFG_TRGS           (0x7U<<4)
#define TIMER4_SMCFG_TRGS_0         (0x1U<<4)
#define TIMER4_SMCFG_MSM            (0x1U<<7)
#define TIMER4_SMCFG_ETFC           (0xFU<<8)
#define TIMER4_SMCFG_ETFC_0         (0x1U<<8)
#define TIMER4_SMCFG_ETPSC          (0x3U<<12)
#define TIMER4_SMCFG_ETPSC_0        (0x1U<<12)
#define TIMER4_SMCFG_SMC1           (0x1U<<14)
#define TIMER4_SMCFG_ETP            (0x1U<<15)

// DMAINTEN Configuration

#define TIMER4_DMAINTEN_UPIE        (0x1U<<0)
#define TIMER4_DMAINTEN_CH0IE       (0x1U<<1)
#define TIMER4_DMAINTEN_CH1IE       (0x1U<<2)
#define TIMER4_DMAINTEN_CH2IE       (0x1U<<3)
#define TIMER4_DMAINTEN_CH3IE       (0x1U<<4)
#define TIMER4_DMAINTEN_TRGIE       (0x1U<<6)
#define TIMER4_DMAINTEN_UPDEN       (0x1U<<8)
#define TIMER4_DMAINTEN_CH0DEN      (0x1U<<9)
#define TIMER4_DMAINTEN_CH1DEN      (0x1U<<10)
#define TIMER4_DMAINTEN_CH2DEN      (0x1U<<11)
#define TIMER4_DMAINTEN_CH3DEN      (0x1U<<12)
#define TIMER4_DMAINTEN_TRGDEN      (0x1U<<14)

// INTF Configuration

#define TIMER4_INTF_UPIF            (0x1U<<0)
#define TIMER4_INTF_CH0IF           (0x1U<<1)
#define TIMER4_INTF_CH1IF           (0x1U<<2)
#define TIMER4_INTF_CH2IF           (0x1U<<3)
#define TIMER4_INTF_CH3IF           (0x1U<<4)
#define TIMER4_INTF_TRGIF           (0x1U<<6)
#define TIMER4_INTF_CH0OF           (0x1U<<9)
#define TIMER4_INTF_CH1OF           (0x1U<<10)
#define TIMER4_INTF_CH2OF           (0x1U<<11)
#define TIMER4_INTF_CH3OF           (0x1U<<12)

// SWEVG Configuration

#define TIMER4_SWEVG_UPG            (0x1U<<0)
#define TIMER4_SWEVG_CH0G           (0x1U<<1)
#define TIMER4_SWEVG_CH1G           (0x1U<<2)
#define TIMER4_SWEVG_CH2G           (0x1U<<3)
#define TIMER4_SWEVG_CH3G           (0x1U<<4)
#define TIMER4_SWEVG_TRGG           (0x1U<<6)

// CHCTL0 Configuration

#define TIMER4_CHCTL0_CH0MS         (0x3U<<0)
#define TIMER4_CHCTL0_CH0MS_0       (0x1U<<0)
#define TIMER4_CHCTL0_CH0COMFEN     (0x1U<<2)
#define TIMER4_CHCTL0_CH0COMSEN     (0x1U<<3)
#define TIMER4_CHCTL0_CH0COMCTL     (0x7U<<4)
#define TIMER4_CHCTL0_CH0COMCTL_0   (0x1U<<4)
#define TIMER4_CHCTL0_CH0COMCEN     (0x1U<<7)
#define TIMER4_CHCTL0_CH1MS         (0x3U<<8)
#define TIMER4_CHCTL0_CH1MS_0       (0x1U<<8)
#define TIMER4_CHCTL0_CH1COMFEN     (0x1U<<10)
#define TIMER4_CHCTL0_CH1COMSEN     (0x1U<<11)
#define TIMER4_CHCTL0_CH1COMCTL     (0x7U<<12)
#define TIMER4_CHCTL0_CH1COMCTL_0   (0x1U<<12)
#define TIMER4_CHCTL0_CH1COMCEN     (0x1U<<15)

// CHCTL1 Configuration

#define TIMER4_CHCTL1_CH2MS         (0x3U<<0)
#define TIMER4_CHCTL1_CH2MS_0       (0x1U<<0)
#define TIMER4_CHCTL1_CH2COMFEN     (0x1U<<2)
#define TIMER4_CHCTL1_CH2COMSEN     (0x1U<<3)
#define TIMER4_CHCTL1_CH2COMCTL     (0x7U<<4)
#define TIMER4_CHCTL1_CH2COMCTL_0   (0x1U<<4)
#define TIMER4_CHCTL1_CH2COMCEN     (0x1U<<7)
#define TIMER4_CHCTL1_CH3MS         (0x3U<<8)
#define TIMER4_CHCTL1_CH3MS_0       (0x1U<<8)
#define TIMER4_CHCTL1_CH3COMFEN     (0x1U<<10)
#define TIMER4_CHCTL1_CH3COMSEN     (0x1U<<11)
#define TIMER4_CHCTL1_CH3COMCTL     (0x7U<<12)
#define TIMER4_CHCTL1_CH3COMCTL_0   (0x1U<<12)
#define TIMER4_CHCTL1_CH3COMCEN     (0x1U<<15)

// CHCTL2 Configuration

#define TIMER4_CHCTL2_CH0EN         (0x1U<<0)
#define TIMER4_CHCTL2_CH0P          (0x1U<<1)
#define TIMER4_CHCTL2_CH1EN         (0x1U<<4)
#define TIMER4_CHCTL2_CH1P          (0x1U<<5)
#define TIMER4_CHCTL2_CH2EN         (0x1U<<8)
#define TIMER4_CHCTL2_CH2P          (0x1U<<9)
#define TIMER4_CHCTL2_CH3EN         (0x1U<<12)
#define TIMER4_CHCTL2_CH3P          (0x1U<<13)

// CNT Configuration

#define TIMER4_CNT_CNT              (0xFFFFU<<0)
#define TIMER4_CNT_CNT_0            (0x1U<<0)

// PSC Configuration

#define TIMER4_PSC_PSC              (0xFFFFU<<0)
#define TIMER4_PSC_PSC_0            (0x1U<<0)

// CAR Configuration

#define TIMER4_CAR_CARL             (0xFFFFU<<0)
#define TIMER4_CAR_CARL_0           (0x1U<<0)

// CH0CV Configuration

#define TIMER4_CH0CV_CH0VAL         (0xFFFFU<<0)
#define TIMER4_CH0CV_CH0VAL_0       (0x1U<<0)

// CH1CV Configuration

#define TIMER4_CH1CV_CH1VAL         (0xFFFFU<<0)
#define TIMER4_CH1CV_CH1VAL_0       (0x1U<<0)

// CH2CV Configuration

#define TIMER4_CH2CV_CH2VAL         (0xFFFFU<<0)
#define TIMER4_CH2CV_CH2VAL_0       (0x1U<<0)

// CH3CV Configuration

#define TIMER4_CH3CV_CH3VAL         (0xFFFFU<<0)
#define TIMER4_CH3CV_CH3VAL_0       (0x1U<<0)

// DMACFG Configuration

#define TIMER4_DMACFG_DMATA         (0x1FU<<0)
#define TIMER4_DMACFG_DMATA_0       (0x1U<<0)
#define TIMER4_DMACFG_DMATC         (0x1FU<<8)
#define TIMER4_DMACFG_DMATC_0       (0x1U<<8)

// DMATB Configuration

#define TIMER4_DMATB_DMATB          (0xFFFFU<<0)
#define TIMER4_DMATB_DMATB_0        (0x1U<<0)
